Revit 2027 API
ElectricalEquipment.IsValidDistributionSystem Method
 Verifies that the Distribution System can be assigned to the Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidDistributionSystem(
	DistributionSysType distributionSystem
)
Public Function IsValidDistributionSystem (
	distributionSystem As DistributionSysType
) As Boolean
public:
bool IsValidDistributionSystem(
	DistributionSysType^ distributionSystem
)
member IsValidDistributionSystem :
        distributionSystem : DistributionSysType -> bool
Parameters
distributionSystem DistributionSysType
 The Distribution System to be checked.
Return Value
Boolean
 True if the Distribution System can be assigned to the Electrical Equipment.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace